# # # # # # str="010-9898-9283"
# # # # # # print(str.replace("-", "")

# # # # # # 지갑=[10000, 5000, 1000]
# # # # # # 만원, 오천원, 천원 = 지갑
# # # # # # print(f'{만원} 2장, {오천원} 3장, {천원} 1장')
# # # # # 로또=[1, 2, 3, 4, 5, 6]
# # # # # # print(로또[1:3])
# # # # # # 짝수 = list(range(2,12,2))
# # # # # # print(짝수)
# # # # # # print(짝수[len(짝수)-1])
# # # # # # 로또.reverse()
# # # # # # # print(로또)
# # # # # # 양파같은= [[2,0], [3,1]]
# # # # # # print(양파같은[1][1]


# # # # # 양파=["i like a apple"]
# # # # # 뉴양파=양파[0].replace("like", "hate")
# # # # # print(뉴양파)
# # # # 양파="123"

# # # # 양파리스트=list(양파)

# # # # ㅋㅋ="".join(양파리스트)
# # # # print(ㅋㅋ)
# # # 개수=int(input("붕어빵 몇개 사세요"))

# # # if 개수 > 9:ㅗㅕ
# # #     print("개수는 9개 이하로 
# # # 입력= input("입력값을 입력해주세요")
# # # 가운대_인덱스=int(len(입력)/2)
# # # if len(입력)%2 !=0:
# # #     print(입력[가운대_인덱스])
# # # else:
# # # #     print(입력[가운대_인덱스-1:가운대_인덱스+1]
# # # 맛의종류 = input("맛의 종류를 입력하세요")

# # # 수량을  = input("수량을 입력하세요")
# # # 붕어빵=[팥_붕어빵:10, 슈크림_붕어빵:10, 초코_붕어빵:10]
# # # while True:
# # #     if 맛의종류
# # # print(8928)
# # # for i in range(5):
# # #     print("반복이 되게 신기하네", i)
# # # 과일 = ["망고", "사과", "두리안"]
# # # for i in "과일":
# # #     print(i,end='')
# # 정수 = [10,2, 9]
# # 부호 = [True, False, True]
# # 합 = 0
# # for k, v in zip(부호, 정수):
# #     if k:
# #         합 += v
# #     else:
# #         합 -= v
# # print(합)
# i=1
# while i <10:
#     print('이정도로 성장할줄이야',i)
#     i+=1
i=0
while True:
    i+=1
print(i)
